/****#include <iostream>
using namespace std;

int main() {
    float a1 = 1000, b1 = 0.0001;
    float s1 = a1 + b1;     // a+b
    float s2 = s1 * s1;     // (a+b)^2
    float s3 = a1 * a1;     // a^2
    float s4 = 2 * a1 * b1; // 2ab
    float s5 = s3 + s4;     // (a^2 + 2ab)
    float s6 = s2 - s5;     // (a+b)^2 - (a^2 + 2ab)
    float s7 = b1 * b1;     // b^2
    volatile float ans1 = s6 / s7;    // ((a+b)^2 - (a^2 + 2ab))/b^2
    cout << "float: " << ans1 << "\n";

    double a2 = 1000, b2 = 0.0001;
    double f1 = a2 + b2;     // a+b
    double f2 = f1 * f1;     // (a+b)^2
    double f3 = a2 * a2;     // a^2
    double f4 = 2 * a2 * b2; // 2ab
    double f5 = f3 + f4;     // (a^2 + 2ab)
    double f6 = f2 - f5;     // (a+b)^2 - (a^2 + 2ab)
    double f7 = b2 * b2;     // b^2
    volatile double ans2 = f6 / f7;   // ((a+b)^2 - (a^2 + 2ab))/b^2
    cout << "double: " << ans2 << "\n";
    return 0;
}

/*
1) Вычислить значение выражения, при a = 1000, b = 0.0001, используя вещественные типы данных float и double. Вычисления выполнять с применением промежуточных переменных. Сравнить и объяснить полученные результаты.
2) Результаты работы программы для типа float: 6.25e+06
3) Результаты работы программы для типа double: 1.00117
4) 
    a)Тип float хранит 24 бита мантиссы, что соответствует примерно 7 значащим цифрам. Для чисел порядка 10^6 шаг представления равен: 2^(19-23)=0.0625.
      Поэтому значения (a+b)^2 и a²+2ab в float могут отличаться только на величину, кратную 0.0625:
        (a+b)^2 округлилось до 1000000.25;
        a²+2ab округлилось до 1000000.1875;
        s6 = 0.0625, b^2 = 1e-8, деление s6 на b^2 даёт: 6.25*10^6.
    b)Тип double хранит 53 бита мантиссы 16 значащих цифр. Шаг представления для чисел порядка 10^6 равен: 1.16*10^(-10).
      Этого достаточно, чтобы разность (a+b)^2 − (a^2+2ab) была равна  1.17*10^(-11)
        f6 = 1.17*10^(-11), b^2 = 1e-8, деление f6 на b^2 даёт: 1.00117.
    float теряет точность полностью — ответ отличается от истинного в миллионы раз.
    double даёт ответ, близкий к правильному, но с погрешностью порядка 10⁻³ из-за вычитания близких чисел.
    Для корректного решения выражение нужно предварительно упростить алгебраически или использовать арифметику повышенной точности (long double).
*/
